Update transformers_in_AI.md
